Revit 2026 API

# ComboBoxDropDownClosedEventArgs Class

---

The event arguments used by ComboBox's DropDownClosed event.

SystemObject SystemEventArgs Autodesk.Revit.UI.EventsRibbonItemEventArgs Autodesk.Revit.UI.EventsComboBoxDropDownClosedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxDropDownClosedEventArgs : RibbonItemEventArgs
```
```vb
Public Class ComboBoxDropDownClosedEventArgs
	Inherits RibbonItemEventArgs
```
```cpp
public ref class ComboBoxDropDownClosedEventArgs : public RibbonItemEventArgs
```
```fsharp
type ComboBoxDropDownClosedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
```

The ComboBoxDropDownClosedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComboBoxDropDownClosedEventArgs | Initializes a new instance of the ComboBoxDropDownClosedEventArgs class |

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. (Inherited from RibbonItemEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace